[
  "Mon May 13 2024 - 11:58 PM: Will I woik?",
  "Tue May 14 2024 - 12:04 AM: Testing\nmultiple\nlines",
  "Tue May 14 2024 - 12:04 AM: Testing\n    spaces\n        \n            and empty lines.",
  "Tue May 14 2024 - 12:06 AM: Testing\n        spaces\n\n                     and empty lines.",
  "Tue May 14 2024 - 12:09 AM: display\n\nthe empty\n\n             lines",
  "yay\n\nyay?",
  "Okay, I have this set up finally. Worked for 4 hrs with gpt 3.5 last night just to get this going. \n\nI'm hoping to give enough love to my neglected projects that they will survive in the wild by themselves.",
  "It's not easy to get going and then once I get going I feel like I should stop because I've had to start over so much just by perfecting things. \nI guess I work with a lot of projects that are vulnerable to perfectionism.\n\nEither way, today my plan is to get this log onto the Github the way that it is. \n                \n      If it goes the way I want I can have a good log with a list of my local to-do's. Maybe I can make my OWN Jira like Kanban board... although I think a physical one might be better for me. \n\n      If I described all of the issues I had just STARTING this log, I would lose an hr. Oh man... DAYS if I really went into \"I first started to make a blog with a database..\"\n\n      Either way, thanks to Chat GPT for helping me out. It's just a lot quicker to get it going if you understand a little bit about it. I can tell it's in a spot where if I keep going I can get permanent results and that's EXACTLY what I am after.",
  {
    "timestamp": "May 19, 2024 at 9:16 PM",
    "text": "Hello"
  },
  {
    "timestamp": "May 19, 2024 at 9:17 PM",
    "text": "Is this going to save in the\n                              same format\n                                          ...  or am I going to have that..."
  },
  "Let me guess... \"[Object}\"?",
  "Well... I was happily wrong! \nGPT FTW.",
  "9:43PM 5/19/2024. \n\nGot back from Niagara falls with the family just a few hrs ago. \nChat GPT got an update while I was gone. I was finally getting success with it making this log not goo long ago. ATM it won't display times and dates...\nSo for visibility, I've added the timestamp manually into the log. \nChi's trip planning skills make me sure she would be successful doing anything.",
  {
    "timestamp": "2024-05-21T10:07:51.370Z",
    "log": "Hmm.",
    "image": ""
  },
  {
    "timestamp": "2024-05-21T10:17:00.446Z",
    "log": "A bobbity booopy!",
    "image": ""
  },
  {
    "timestamp": "2024-05-22T00:47:06.840Z",
    "log": "Testing a pic entry...",
    "image": "/uploads/64b59e9927d891c06415bef2325a200d"
  },
  {
    "timestamp": "2024-05-22T00:51:42.810Z",
    "log": "Wets twy vis again.",
    "image": "/uploads/9c0f1ccf686e69ccabb15a795e51b950"
  },
  {
    "timestamp": "2024-05-22T02:58:32.099Z",
    "log": "Main log only...",
    "image": ""
  },
  {
    "timestamp": "2024-05-22T03:10:01.307Z",
    "log": "Alriiiiight! \r\n\r\nFinally at a plateau where I can work with a little layout and CSS business. I have this log and my log for Gabby up on github, so I'm golden there.\r\n\r\nSo in my work life I am sucking beyond belief but my home life is the bomb and I make progress like this and it's great. \r\n\r\nNio is interested in music AND sports, he's smart as a whip too, a good person , what matters most.",
    "image": "/uploads/cc2f7485334517a5ace8c00c565ad22a"
  },
  {
    "timestamp": "2024-05-22T03:29:15.655Z",
    "log": "One thing that I am proud of myself for is correcting the crap out of chat GP when it messes up. It might be at some point where it makes sense to keep it inefficient because the mistakes it makes doesn't make sense for something with direct reference to your code. \r\n\r\nSo I'll find something and tell it. I like how it stumbled through the process enough to expose me to the server side code. I could understand it much better.",
    "image": "/uploads/caa65cc50968968e4d7526edd3bd5fd9"
  },
  {
    "timestamp": "2024-05-22T05:04:54.152Z",
    "log": ".Tif files don't work, but let's see if it can handle a huge 200megapixel photo...",
    "image": "/uploads/b44e49dadbf9368b24ef76eee6817dba"
  },
  {
    "timestamp": "2024-05-24T01:10:29.108Z",
    "log": "Okay, well... that'll take forever to load over time. good thing this isn't a photo blog. ... yet.\r\nOne thing that I've done and I'm overly used to doing is STARTING a log and not finishing it. \r\nIt's been harder over the years because I wanted to make one ala the 21st century, I.E. a website.\r\nI've wanted to make a website for a long time, and before the internet, I've wanted to make comic books and movies.\r\n\r\nI guess... an introduction is in order... que the music.\r\nThe setting, in the smokey, unfinished basement in urban america, Ann Arbor Michigan. The walls, raw concrete painted white.\r\n       The music: Stereo MC's \"Connected\" from my \"Growin Up\" Spotify mix.\r\n The smell, weed and incense.\r\n\r\n    The lighting: overhead shitty white light bars, good for drawing, bad for computing. \r\n\r\n   I'm 43, born and raised in Saginaw Michigan, moved to Los Angeles for five years 2003 - 2008\r\n        Didn't do ANYTHING I went there to do, break into the film industry, write, direct, film, choreograph a movie, or TV show.\r\n          Met my wife Chi, travelled a bit.\r\n                                 Worked at wholefoods for 8 years till 2016\r\n                                    Went to school and took a break to tackle alcoholism.\r\n                                          Got into programming. \r\n                                            Got a job through friends at a good business, #1` now in Mortgages, and got some money too. \r\n\r\n\r\n    Now I'm a release coordinator, and the stress is madness because the whole entire companies website is on your shoulders often times.\r\n\r\n     I set up this website using help with CHATGPT 4. AI that is getting better more and more rapidly. I understood enough of it to save me some serious time. It's not perfect yet. \r\n\r\n      I'm about to take a trip to Denver to see my good friend Sean Galaviz and get some inspiration. It should be great to feel and breathe the Denver air.",
    "image": ""
  },
  {
    "timestamp": "2024-05-27T18:42:05.991Z",
    "log": "Alright! Back into the fray! Denver was great. Seeing Sean again was a blessing from the lords. \r\nHis friend Justice and I talked about my issues in the programming world and it really helped my mental health. He advised me to stick with it, nobody's going to fire you, any correction is only that.\r\nGotta love these guys.\r\n\r\nOkay today I realized that I'm at the spot in my project where I can set up the project, but I have to poor a lot of time into my drawing skils.\r\nThey are good, but not there yet. I need to focus on the character designs of Gabby, Michael, July, Gabby's Mom, and the Bully and his dad, get some practice with gesture, figure and motion.\r\nHere's my basic list for next month.\r\n\r\n1. Character design.\r\n2. Framework research and decision.\r\n3. 60 hrs of practice.\r\n4. Large project decision\r\n\r\n\r\n\r\nIt's really nice to give myself a month to do anything. The 60 hrs of practice should be the hardest to get in here. Now let's roll.",
    "image": ""
  },
  {
    "timestamp": "2024-05-27T18:42:49.220Z",
    "log": "K",
    "image": ""
  },
  {
    "timestamp": "2024-05-27T19:44:48.126Z",
    "log": "Log?",
    "image": ""
  },
  {
    "timestamp": "2024-05-30T00:21:09.785Z",
    "log": "Another not so good day as a release coordinator at UWM. I hope things get better. I keep making the worse mistakes.\r\n\r\nThis is where I'm at with my shtuff:\r\n\r\n1. Character design.\r\n2. Framework research and decision.\r\n3. 60 hrs of practice.\r\n4. Large project decision\r\n\r\n  \r\n   Tonight I might start Gabriella's Ghastly Gift in a react project. \r\n\r\n   If I can get some actual hands on experience with the Use State, and develop showcase worthy art, I'm golden.",
    "image": ""
  },
  {
    "timestamp": "2024-06-02T21:30:48.417Z",
    "log": "I've knocked off #2. \r\nI have started the practice, I'm at 3 hrs, JUUUST ahead. \r\nMy large project decision I think will revolve around painting. I want to do a classic artwork something acrylic I can sink my teeth into.\r\n\r\n1. Character design.\r\n2. 60 hrs of practice.\r\n3. Large project decision. \r\n\r\n\r\n\r\n   I'm ecstatic  with my log. I can sink my teeth into this too with some design. Looks Right now it looks pretty bland, but I can change that.\r\n\r\n   If I can get anything going to night. I will be creating a practice React project so I can get Gabby going with some things already figured out. Quite exciting.",
    "image": ""
  },
  {
    "timestamp": "2024-06-04T01:30:50.264Z",
    "log": "Okay, so far I've logged two hrs during the weekend drawing and two hrs today. I MAY do extra, but I have to set up the projects I'm doing.",
    "image": ""
  },
  {
    "timestamp": "2024-06-06T10:01:56.835Z",
    "log": "Last night I tried making the Gabby comic book, it was day 2 on using react. I ran into issues iwth compatibility and GPT literally told me to delete node.js ...? I don't know.\r\n\r\n\r\nI WILL try to salvage this instead of starting over, but only once more. It's too early to run in circles when I can hit up the website as well.\r\nI've done that before, bouncing back and forth, but as things change, I learn a bit more every time.",
    "image": ""
  },
  {
    "timestamp": "2024-06-11T15:27:01.235Z",
    "log": "Crisis at work. \r\n\r\nI made some mistakes and sent some teams messages that could be considered threatening. \r\n\r\nOnly after my bosses came off as threatening to me, but you know how it goes, they're unlikely to feel any consequences and I am likely to feel the full brunt.\r\n\r\n*Sigh.\r\n\r\nThe last job that I left, it was also because they deemed me too stupid to learn. Only Xiela at Lab Express gave up training me before she even showed up that day.\r\n\r\nAlmost just as bad, I'm going to have to tell the story anyways for my own sanity here.\r\n\r\n\r\nMy friends used to work at UWM, so they remember the more golden age where they weren't as corporate.\r\n\r\nWhen I joined, they had these goals, one of them was retention, one of them was being the #1 place to work.\r\n\r\nThe #1 place to work goal went away right away, and the 85% retention was soon to follow. They were replaced by the goal of \"Team member participation.\" \r\nThat just means that you go to the parties, the fair and give people kudos.\r\n\r\nI was placed on the Dev Ops team. This is newer technology. Easier to handle, I overthought everything. \r\n\r\nThere was a big problem in my personal life. Chi and I were having huge issues. I couldn't focus at work. I SHOULD make an entry about our problems because we have a beautiful story, but I need to avoid too long of a post.\r\n\r\nI couldn't produce for my team and I've never been in that situation before. I had imposters syndrome. One morning, before work I was going to have a meeting with my Tl's Tl, Andy French. \r\n\r\nI was driving and I thought to myself \"Okay, as long as I don't hear, 'I don't think you belong here.' I'm going to stick it out, no matter how bad it is.\"\r\n\r\nBefore the meeting even started, I saw Andy at his desk and said \"I am a LITTLE miserable right now, but we can discuss it at the meeting.\" he said \"I don't think you belong here.\" \r\n\r\nWithin about a minute, he had repeated this a couple more times. I was convinced that I was inferior for the role. I was in fact, hired along side Trent, Jenn, and Chitra, and I was witnessing Chitra's growth in Yaml, as I couldn't concentrate.\r\n\r\nSo I understood Andy's desire to rid himself of me. He let me find a place to go, and I was able to shadow people. \r\n\r\nSome of the other people I looked up to had also been RC's before me... and it looked like it was mostly a moving checklist. Which that's what it is. \r\n\r\nI took the position as a Release Coordinator. It turned out to be very high anxiety, very high pressure. It's several moving checklists, all of them complicated, some of them random, they all have a lot of steps and every mistake made is a critical one. \r\n\r\nI hated it after a month. I let my new boss Thomas, know that I wanted out. \r\n\r\nI soon stressed that the anxiety was making my stomach go crazy. \r\n\r\nThomas agreed to help me find a place, but only if I could prove that I was improving, so he could stand behind me when another leader asks.\r\n\r\nThis was when the real problems began. \r\n\r\nIn order to measure my progress, I was put under a microscope, where every mistake I made was recorded in an excel sheet by 2 other people. I had to respond to every mistake. \r\n\r\nIn this environment, some mistakes lead to others, and it's not even apparent when that happens all of the time. Some called out mistakes were duplicates of others and mistakes could be made in so many different areas it's insane.\r\n\r\nAside from that, a good percentage of my  mistakes are simply brain farts due to anxiety. \r\n\r\nAfter a few months of this I felt more and more like hell. \r\n\r\nI ended up under Thomas with Andy as his TL, and this continued. \r\n\r\nI started taking things personally in meetings, which was a huge mistake on my part. \r\n\r\nI tried to seperate myself from taking things personally. However something personal happened.\r\n\r\nIn the very beginning of my time as a Release Coordinator, I saw my TL, Thomas Yang, a man of about 180lbs, and my height, my age, deceive an entire floor of people trying their best in a weight loss challenge by putting rolls of coins in his pockets during the first weigh in. \r\n\r\nOther than this there have been other cunning moves by him. \r\n\r\nThe worst started to happen when months had gone by and I had made \"no progress\". The number of my mistakes went up. I had no defense and I was so swamped in my job that I couldn't examine the process itself.\r\n\r\nSo I kept at it. By the next time we did it, a month later or so, I had had it. This time I got very suspicious that they simply weren't interested in actually helping me move on. \r\n\r\nThis suspicion got worse as time went on and I couldn't find a sign pointing in the other direction. I was an RC indefinitely. \r\n\r\nSo my stomach started to really go insane, and after the last meeting I started getting angry. I called my TL and his TL out on their leadership skills, outlining that I was not the TYPE of person for this specific position, and that measuring my abilities here made no sense. \r\n\r\nIt's like judging a fish on it's ability to climb a tree, and demanding it does great, or you won't support it's move into the water. \r\n\r\nI used square hole/round peg wording, and it wasn't a pretty outcome. I should have used better wording. \r\n\r\nThey had a meeting with me that day, and things got heated. We moved from a meeting room called Imlay city, to my favorite meeting room Discovery.\r\n\r\nIt was in that room that I proved the system they had been using to judge my progress was broken. They agreed upon that. We made some augmentations.\r\n\r\nDuring this talk, Andy gave me these darting looks, and asked me if I still had my 40K (The money borrowed by the company)  At the moment, I just got angry inside, and held it in.\r\n\r\nThomas kept telling me over and over that they could have fired me. \r\n\r\nI half wish that they had.\r\n\r\nI don't know.\r\n\r\nSince then we had the fair, and I took Nio, but I couldn't stop thinking about the money, about how I'm stuck.\r\nI couldn't stop getting stomach aches.\r\n\r\nSo I contacted Thomas and Andy with a teams message, trying to be assertive, but useful.\r\n\r\nI'm sure it came off as god aweful, but one important part is that I pointed out 5 faults with the system, and that it had cost ME time.\r\n\r\nI couldn't however, wait until I got in to discuss them. I was having flashbacks and my stomach was churning every time I thought of them, and my situation, and how little time I'm going to have to think for the next couple of months, being an RC.\r\n\r\nSo I had to take yesterday off. During the day, I teamsed Andy that I didn't want to feel threatened by him anymore. I made a pretty dramatic deal of it. \r\nI then contacted TMS (HR) and told them that I didn't feel comfortable around my leadership. I know this is going south but my stomach churns and churns as I write this. \r\n\r\nI hope I can smooth things out at work and end up actually producing in a steady pace for a TL not known for being menacing... but I might be fired, or forced to resign.",
    "image": "/uploads/059221288fcf5ab49f371e465f26391d"
  },
  {
    "timestamp": "2024-06-22T15:04:31.878Z",
    "log": "My crisis continues at work. \r\nI lost my patience and said the wrong thing to my boss. \"Grow up\" and they put me on a final warning.\r\n\r\nNow I'm at risk of losing out on this career. Losing 40k and losing 80k next year.\r\n\r\nChihiro would be devastated. I would feel great for about a week, before I realized I couldn't produce on my own and I would just find a shitty job.\r\n\r\nI don't want that at all. I don't like that those are my only options, I would LIKE to think, that if I was fired, I could throw down a Youtube, Instagram, Reddit, 3 some and make some art and make more money doing that by a years time.\r\n\r\nOne years time is probs impossible, but I should try while I still can I think. \r\n\r\nToday, to take myself more seriously with this \"Carson make art = Carson make money\" idea, I went ahead and wrote down the beginning steps to starting ones own business.",
    "image": ""
  },
  {
    "timestamp": "2024-07-01T19:05:10.281Z",
    "log": "Well the crisis a work is over. They fired me.\r\n\r\nIf it wasn't for financial strain, I'd be happy with this. I am going to try to make the best of it.\r\nOne way to do so is to get more experience outside of work that I got WHILE working. \r\nWith the expectations of dishes and laundry and everything it's going to be really hard, but with good scheduling, I can get anything done. \r\n\r\nSo, I have to do chores, find a job, and get experience at the same time. I nearly pass out from exhaustion thinking about it. \r\nI also want to stop smoking, something I'm already doing terribly at.\r\n\r\nMy checklist for starting a business, which I am super afraid of. \r\n\r\n1. Create a business plan.\r\n2. Choose business Structure\r\n3. Register Business\r\n4. Get Finances in Order\r\n5. Conduct Market Research\r\n\r\n\r\nI also need a name for my youtube channel. \r\n\r\nI also need to start the Gabby project for real.\r\nThis time instead of relying on gpt, which landed me in a circle of npm issues, I'll use the online tutorial and try to finish one. If I can get one finished, then I might be able to tweak it.",
    "image": ""
  },
  {
    "timestamp": "2024-07-05T16:59:31.395Z",
    "log": "I don't want to say what I'm hoping to accomplish in the next 20 weeks, because I don't want to jinx myself.\r\n\r\n\r\nI sit here trying to make this decision. \"Do I try to create this website, do a twitch stream for revenue and sell myself for cash and creation and freedom rather than working for the man? I am set up for it. \r\nBut it's such a huge task. I don't even think I'm ready in terms of skill yet. \"... but I've started so late, lived so long under the guide of others. My soul is institutionalized. I do nothing without a boss telling me. \r\nSince this task is my own, there is no boss... and it is so difficult, and takes such time... the task is nearly impossible.\"  I say to myself.\r\n\r\nCasey appears out of nowhere inside of my head. \"What are you going to do Carson? Go back to alcohol? I don't think so. Heh, start smoking CRACK?! RIGHT! You are listening to the illusion created by society that you're not good enough. \r\nTHEY're not good enough. They need YOU.\"\r\n\r\n\r\nVisions of Casey come around. He talks to me out of nowhere in my head. Rooting me on. Fuck the man, Casey. \r\n\r\nI've had GPT make me a schedule. I have to push hard, and steady at this or I'll break. \r\n\r\nToday is no exception. time to go back to work.",
    "image": ""
  },
  {
    "timestamp": "2024-07-05T18:25:45.961Z",
    "log": "I have a schedule to go by: \r\n\r\nSchedule to Stay Productive\r\nCreating a structured schedule can help you stay productive and minimize distractions. Here's a suggested weekly schedule to help you prepare for your Twitch stream launch:\r\n\r\nWeekly Schedule\r\nMonday to Friday:\r\n\r\n8:00 AM - 9:00 AM: Morning Routine & Planning\r\n\r\nBreakfast, light exercise, and review the day's tasks.\r\n9:00 AM - 12:00 PM: Drawing Practice\r\n\r\nFocus on hands and dogs, using reference materials and tutorials.\r\n12:00 PM - 1:00 PM: Lunch Break\r\n\r\nRelax and recharge.\r\n1:00 PM - 3:00 PM: Channel Setup & Content Planning\r\n\r\nCustomize your Twitch channel, create overlays, and plan content ideas.\r\n3:00 PM - 4:00 PM: Social Media Engagement & Promotion\r\n\r\nEngage with your audience on Instagram, Reddit, and other platforms. Promote your upcoming streams.\r\n4:00 PM - 5:00 PM: Break & Family Time\r\n\r\nSpend time with your child and address any social issues.\r\n5:00 PM - 7:00 PM: Practice Streaming & Technical Setup\r\n\r\nTest your streaming setup, practice going live, and troubleshoot any issues.\r\n7:00 PM - 8:00 PM: Dinner Break\r\n\r\nEnjoy a meal and relax.\r\n8:00 PM - 10:00 PM: Personal Time & Reflection\r\n\r\nReflect on the day's work, relax, and spend time on personal interests.\r\nSaturday & Sunday:\r\n\r\nFlexibility: Use these days to catch up on any missed tasks, spend more time with your family, or enjoy leisure activities.\r\n\r\nI will probably need to tweak this, but I wanted to get it down here before it gets lost in my history. Infact, I think I can go ahead and change it in the html. I'll comment it in there for now. I don't know what I'm doing f'ing around with my notes project when I am I supposed to be setting up my twitch stream and practicing.",
    "image": ""
  },
  {
    "timestamp": "2024-07-07T20:24:11.629Z",
    "log": "This weekend has proven to be completely unproductive.\r\n\r\nChi and I got into an argument and I get so emotionally distressed that I freeze up for days. \r\n\r\nI made some mistakes I had to admit to. I sent some texts that were angry and vague. I know more than anybody how that it can be torture to receive nonsense texts.\r\n\r\nWe've made up and things are good. But I have a long road ahead of me.\r\n\r\nI can feel the pressure of the unsurmountable task of making a comic book website and it's just crayzy.\r\n\r\nIt sends me into hrs long internet scrolls. I can't function like that and make it as an artist. I have some CRAZY adjustments that I will have to make.",
    "image": ""
  },
  {
    "timestamp": "2024-07-08T15:35:09.192Z",
    "log": "Twitch Topic:\r\n\r\nSeeing the beauty in things = 100\r\nPointing them out = 1000.\r\n\r\nThe internet. \r\nThe crowning achievement of the information age. It's often pointed out that the driving force behind this huge part of our daily lives was horny people looking for porn. \r\nTo AVOID politics on this platform, I want to point out that it has never been even in QUESTION that this was by far the majority being males looking for females. \r\n\r\nFirst off, I want to divulge any ideas that something sexual is inherently ugly. I disagree with that idea, I think that since the vast majority of creatures on earth are sexual, the idea that such a quality also makes it ugly is crazy.\r\n\r\nI think that the female body is SO undeniably, unfathomably beautiful that the effort of seeking out experience with it was such a force that it sped up the development. \r\nI think it was beautiful blooming of a digital flower that gives credence to artwork, INCLUDING pornography if you can see it as such.",
    "image": ""
  },
  {
    "timestamp": "2024-07-22T00:27:40.524Z",
    "log": "The preparation:\r\n\r\nTomorrow is Monday, it's the first week without Chihiro and Nio home, and a job calling my energies away.\r\nI have cleaned the basement and cut the weed from the work area. \r\n\r\nI am hoping next week, will be an inspiring week of productivity. \r\nI pray to God, that I can be an artist for a living. I am ready for some real adult challenges now.",
    "image": ""
  },
  {
    "timestamp": "2024-07-22T15:11:47.887Z",
    "log": "AAAND We're off. \r\nI have had my first two failures. 1 in my React project. I completely deleted the whole thing by accident while trying to move it.\r\nYay.\r\n\r\nI learned that the Desktop, is no longer ones own property. It's actualy GoogleClouds/CarsonsDesktop. \r\nMoving things around or deleting code they could potentially use is difficult.\r\n\r\nThe other failure was weed. I smoked at 10am. Didn't even make it to noon. here's to trying. Hopefully I can make better progress with art today than I did with coding.",
    "image": "/uploads/774d61086efc7aad9acdc1f7caad1904"
  },
  {
    "timestamp": "2024-07-25T19:46:10.263Z",
    "log": "Okay, last was the 22nd. The 23rd and 24th were both me realling from failure. \r\nMy other failure though wasn't weed.... haha. If that was my only problem... \r\nI didn't do anything. that was my issue.\r\n\r\nI've been looking into react and I can't believe how much time I had put into it without learning anything and I've tried so many times to start my own project and failed.\r\nIt's SO daunting.\r\n\r\nI'm looking now, into Scrimba. It takes ungodly, unknown amounts of time, but it's skill based. Like learning how to juggle takes forever but over time you just get it.\r\nThat's right up my ally. So I'm going to go right ahead and see if I can get myself to speak too soon by saying it's the way to go.\r\n\r\nRice.",
    "image": ""
  },
  {
    "timestamp": "2024-08-15T17:42:59.381Z",
    "log": "Back from Japan!\r\nFeeling awesome and refreshed. \r\nDid a 5 mile jog off the bat today, meditated... good start. Got some chores done and everything. Good day to be a rock star. \r\n\r\nI still have to get into some art. I have not gotten into that yet today. I am having the hardest time not smoking. I don't know if I can make it today without it. I keep thinking about it. Idk. \r\n\r\nRice.",
    "image": ""
  },
  {
    "timestamp": "2024-08-15T18:57:44.242Z",
    "log": "The story, of my hair.\r\n\r\nAs told by Carson Keene 08/15/2024\r\n\r\nI was born with silky blonde hair, but it quickly turned brown and got wiry.\r\nIt was hard to handle and in the first grade we started cutting it short. I could just brush it back and it would stand up. \r\n\r\nIf I didn't have it cut regularly, it would still stick straight up and I was gifted a Kramer poster once which I proudly displayed in my bedroom. I tried to grow it longer in school but it would never lay down. I would get out of the shower and as it dried it would take any form it wanted regardless what I did. I had the worst dandruff at one point,  it was hell. \r\nIn an effort to control it I would frequently wet it down. One friend of mine, I think it was Zach Hitow, said \"Carson, did you just give yourself a swirly?\", when I came out of the restroom and that joke will never not be funny. \r\n\r\nAt one point it went from wavy to curly and I took a chance and grew it out and I think I only really got it cut once since then. When I first got to L.A. and I thought it would help me get a job. \r\n\r\nSince then it was long and now it's falling out. \r\nIt was beautiful, but now it's a bit more on the rat's tail side of things, and I need a change anyway. \r\n\r\nBye beautiful locks, I'm sorry I never named you. You can't be so important I post a fucking FB post about it. But you do get a forever post in my notebook.",
    "image": "/uploads/35ace961c61c9c92e2c348c5756e6909"
  },
  {
    "timestamp": "2024-08-19T12:12:59.622Z",
    "log": "Another beginning. \r\nToday begins my war against resistance. \r\nNo excuses, just me vs time. \r\nWish me luck.",
    "image": ""
  },
  {
    "timestamp": "2024-08-22T14:21:33.850Z",
    "log": "My war against resistance rages on. I was able to chop up the ramp for Phoenix, now that he is gone, and it is too worn out to be saved. It was a nice project. \r\n\r\nSo far today I have only done DRAWING exercises and took a walk. \r\n\r\nNot much. I openned this actually, because I had a story to write down.\r\n\r\n\r\n\r\n\r\n\r\n                  \"Spacetime. It's one of my favorite words. It creates this, vortex in my mind, this rotation of energy. There's a lot going on in that word. Spacetime.\r\n\r\n              You take the two words and we have the same concept. A measurement of energy. If you change the time it takes to go from one place to the other, you will change the amount of energy used to go the distance.\r\n              Of course, if you change the distance you travel, but keep the time travelled the same, you will also change the energy. \r\n\r\n              You cannot extract time from energy. Any moment in time is responsible for any energy in existence in that moment. You cannot delete time, you can only change it's passing in your perspective at the cost of further energy.\r\n\r\n              The only outcome is that one concept is acting as two.\r\n              This answers a fundamental question. Not, can something come from nothing, but can one thing be responsible for all things. Because if one concept can branch into two concepts, and those concepts are freaking space and time, and from space and time we get universes, the concepts possible thereafter are mind numbing.\r\n\r\n              This also raises a fundamental question. What is a concept itself?  \r\n\r\n              A concept is a rule or limitation we use to understand the various behaviors of the universe? In a way, we see concepts all day long, all the time, and in another, no concept actually exists as a whole. \r\n              Energy is never just energy, it takes two forms of energy alone just to measure energy. \r\n              So it only exists in it's most basic concept and the very act THINKING about measuring it makes some of it disappear. It may exist, but it can't be defined and therefore we can't say it exists. What if we remove the definer, would we be able to prove the existence, and applying the concept of cause and effect, without the observer, it doesn't matter. In order for things to have any value, the universe must create an observer. \r\n              And now you stand, face to face with the concept of yourself.\"\r\n\r\n              I think that's a good rough draft of that.",
    "image": ""
  },
  {
    "timestamp": "2024-08-25T15:32:40.622Z",
    "log": "ANother idea I had:\r\n\r\nThe Ironbird, the Focrater, and the Hoo nut. \r\n\r\n\r\n    ... the iron birds body has evolved to be so in tune with it's environment, that to watch it on it's last flight, is to see the very balance of weight verses lift at play. For by now, the birds beak has become so heavy that it will no longer have the energy to come back up when it dives. It knows this and prepares by flying to a good height, and locking it's wings behind it's back.\r\n\r\n        From here it plunges. For thousands of years man has always assumed that we missed it's resurfacing, or that it used the inertia to swim great distances. It wasn't until recently when this puzzle solved others.\r\n\r\n        The focrater, named for the fact that at first, they appeared to be craters made by unknown forces. These turned out to actually be the translucent circular membranes of the focrater. As the clear liquid inside is filtered into more and more nurturance for it's offspring, the density of the liquid causes the balloon to fall down onto itself and the surrounding ocean floor, resembling a crater from above. \r\n        Once again, for centuries we didn't know much about them. They seemed to disappear out of thin air. \r\n\r\n        The hoo nut is another mysterious creature found at sea. Only near the surface, it looks like a giant upside down bell wrapped with a shell with a rotted hole on the top of it. Little is known because they are rarely seen alive. When they reach the surface, the wide end of the bell opens up and they emit a loud \"hoo\" noise. On a windy day, this noise is repeated endlessly, giving it the name. \r\n\r\n         Some 200 years ago, a stranded ship, thought to be lost to sea, was found by an exploration mission between continents. Though the route between continents was travelled more and more, it is so vast that it is unlikely to see anybody else, until you get to your destination. The stranded ship collided with the coral reef in the a storm and crippled ship had run aground. The crew had taken great effort to repair the ship by then, but the damage to the hull was irreparable without a harder wood. They had been stranded for 11 months, and unless you were part of an exclusive explorers guild, there was no sign of anybody else going near there ever again. \r\n         After being found, the exploration was halted and the crew was returned to their homes immediately. They had only had one death, but they wouldn't speak of it. What they did say, left everyone scratching their heads. They said \"there was a disease, that wasn't a disease.\". \r\n\r\n         Four days after the death of the last survivor, his diary was read aloud, and what was in it, both explained what he saw, and why he didn't say it. It was a parasite. Fish and birds would wash up on shore and be completely fine except for these holes about 3 millimeters long in them. One day, a little girl was speaking with her mother as her mother groomed her hair. They had been on the island for a few months, and they had accepted things and tried to live a normal life. So they were eating breakfast, and her mom was grooming her hair. \r\n         The mother said \"I was so tired last night but, I swear I heard singing.\"\r\n         The daughter confirmed that there was singing. We had all heard some form of low pitched noise that night, but I believe we were all too exhausted to investigate. Life is hard on a jungle island and we were still adjusting. Of course, the little girl wasn't expected to work, and had all the energy of a star in her. I remember how she used to bounce around on the sandy beach like we were in heaven, not ... stranded. We could have all took a lesson from her.\r\n\r\n         Any way she said, \r\n         \"There was a whole bunch of fishies singing last night. I went out to sing WITH them!\"\r\n\r\n          The mom then remembered \"Oh I remember now, you kept going \"hoo!\". \r\n          \"Yeah with the fish, I went 'hoo!'. The fish are my friends!\". \r\n          \r\n          Maybe 3 weeks later, she got a few lumps on her legs. Of course, nobody knew what it was, it was just out of nowhere. Some people thought maybe it was ring worm, but they started popping up on her back too. And then her throat and neck got all swollen. Her face distorted a bit like something was pushing her nose forwards. I saw her daddy make her bend her head all the way back and he looked in her throat with a light. The way he realed back, her throat must've been almost closed with lumps. \r\n          It didn't happen all at once, the first ones came out of her legs a couple of hours apart. They lumps solidified a bit, they didn't itch or anything, and then just all of a sudden she was in mid sentence, she stopped and looked down at her leg and jumped up like she had been stung. We didn't know what was, a bee or a deer fly was all we could think of. Of course there's none of that out here. She started screaming after about 20 seconds and we all rushed to see what was happening. Her leg had a hole, but there wasn't much blood. She said a string came out of it, but we couldn't find it. Half an hour later, we all watched in horror as something poked a hole in her, and squeezed out. The dad grabbed it and wrapped it in a blanket. We were all scared of it, and didn't want to touch it, or touch her, but it wasn't over... the lumps started to tear out of her just as fast as they appeared. She started screaming and her mom held on to her as her body started oozing out these slimy strings that were wiggling around. Then the girl started choking, and I was relieved that I couldn't hear her anymore... but even though I was looking away, I could hear it. \r\n          She was gagging as they tore through her throat and out of her sinuses. I looked for a second when I thought it was all over, but what I saw... The girl must have had it worse in her lungs. Whatever this was coming out, wasn't stopping. Her mother was trying to talk to her, but she was already gone, the stuff just kept coming. A sledge made of a million pinky fingers slithering away. They didn't catch any of them.\r\n          \r\n\r\n          It was only a few years ago, that the mystery was solved. Deep sea scientists set up cameras around the focrater to observe. They expected to see it pop open, and release it's spores into the ocean. Whatever would happen next, would explain the lifecycle of the focrater and science would progress. \r\n          After weeks of observations instead of seeing a focrater pop open, they saw something dive into one at an alarming speed. Unable to discern it with the naked eye, the high speed camera illuminated the silhouette of an ironbird. The ironbird, having shed every bone but it's skull, pierced the focrater and fertilized the spores inside. As the spores fertilize, the chemical reaction produces sulfuric acid, dissolving the iron and making it easily used by the focrater and spores for nutrience. The beak also holds inside of it, a bubble of air.  The focrater, now fertilized digests the body tissues of the ironbird and creates a star shaped membrane around itself, detaches from the ocean floor, and floats up to the surface. \r\n           \r\n           After infecting any warm blooded creature, the parasitic spores use body heat and nutrition to build itself a long slender skeleton with a tiny iron beak. When it's ready, it simply escapes it's host and slithers into hiding to molt and grow. It starts out looking like a snake, but it splits into symmetrical  sides with wings in 24 hrs. After that it looks like a beaked snake with wings. It's tail merely becomes wings and it can achieve flight in 1 weeks time. Diving gives it the main diet of fish as well.",
    "image": ""
  },
  {
    "timestamp": "2024-08-29T14:37:46.945Z",
    "log": "Comic strip website is stuck. I am stuck. I have to make some progress on this soon. I feel like hell. I have to go back to work soon and I don't have anything lined up.\r\nResistance is winning.",
    "image": ""
  },
  {
    "timestamp": "2024-09-10T00:28:33.993Z",
    "log": "Yay, guess what I've accomplished...\r\n\r\n\r\nNOTHING!\r\n\r\n\r\nHelped my family a bit. That actually feels great. The wealth will go to them, not some CEO for mortgage.\r\n\r\nI like rice, but I was drawing today and everything was coming out terribly. It makes me want to give up really bad. I can't let myself though.",
    "image": ""
  },
  {
    "timestamp": "2024-09-12T18:08:18.879Z",
    "log": "29 Days challenge. \r\n\r\nI found a challenge that I find interesting. Why not give it a shot when I get back from Colorado?\r\n\r\nEvery day ask yourself these 3 questions. \r\n\r\n1. What filled me with enthusiasm today?\r\n2. What drained me of energy?\r\n3. What did I learn about myself today?\r\n\r\nOn the 30th day, you take an hr, and go over the last 29 days and answer the same questions regarding that month. \r\n\r\nThe answers are your 40 day graduation certificate.",
    "image": ""
  },
  {
    "timestamp": "2024-09-17T17:19:59.595Z",
    "log": "I just filmed myself for the first time for a twitch stream. The GO -TO \"show everyone your life and see if you can gain success via voyerism... reverse voyerism.\"\r\n\r\nThe camera cut out every 20 minutes and I need a better microphone. I also only went one hour and I guess to be successful you need 4. Either way I need 4 hrs of art every day to be successful anyhow. So there's that. \r\nI was just asking myself what I should be doing and boom. Yup... I need to crunch at art for another 3 hrs today just to meet my own daily quota. Then I have to do SOME FREAKING PROGRAMMING!!! \r\n\r\n Rice.",
    "image": ""
  },
  {
    "timestamp": "2024-09-25T12:49:00.996Z",
    "log": "Stream is taking me a bit to set up. There's a million things to think about. No excuses. It's Wednesday and I better get to work. I'm hindered right now by my mind. \r\n\r\nWorry. \r\nI'm deeply concerned for Nio. His friends betrayed him and then his mother got angry and disowned him for a bit. Hasn't talked to him for a day now.\r\nI don't know why I am that concerned. I guess he doesn't have any good hobbies to delve into so he just wastes time sitting still with life and I can't take that.\r\nI can't take how I watch my son suffer and my wife act like a bitch towards him.",
    "image": ""
  },
  {
    "timestamp": "2024-09-29T19:46:45.968Z",
    "log": "It's SUNDAY! \r\nWell I failed to start my snail React project last week. I ran into another wall. I am forced with a few options\r\n1. Fix it, -if I can I will. \r\n2. Start over. If I start over this time, I have two options. One is to start from scratch with the \"learn react\" website. I have failed there before. My issue is that I don't remember where I failed or why. The next time I try, should I fail again, I'll record why. If not... my other option is to get some other barebones react app and pick it apart, converting it into my own. \r\n\r\nLet's see if I can do that this week.",
    "image": ""
  },
  {
    "timestamp": "2024-10-19T00:47:12.989Z",
    "log": "For the last week, I've been taking an honest crack at being a twitch streamer with my art.\r\nLike filming, writing a book, drawing a comic, becoming a programmer, or almost any other of my goals in life, it's been a complete failure. \r\nI am having the worst microphone issues. I don't know what the deal is, but it either screams bloody murder feedback, or it's too low to hear what I'm saying. \r\nEither way I've spent the last two days working on that issue. \r\nI spent WEEKS on a way to display images from a non public folder out to the web in React like it says you can. Weeks of failure on setting up a comic book project in react.\r\nI could storyboard it faster than simply set it up. \r\nOh well... I guess a lot of life is in the failing. Will I even try again? I hope, but I want to win.\r\n\r\nI look at my art and I think it's the most ametuer bullshit out there. I can't find form well enough, or likeness yet. I think at 43, if you want to be an artist, you really have to have gotten those things down. \r\nI'm going to try to do better at those and really push myself to grow as an artist, but I have to find a paying job too. and that's sad. \r\nBecause, what I want is to just focus on my art skills. I would if I could.",
    "image": ""
  },
  {
    "timestamp": "2024-11-11T12:09:10.252Z",
    "log": "I had quit my twitch stream for one reason or another. I don't think I had a reason, I was just exhausted. The planniing and doing all took a good 8 hrs a day but distractions destroyed my energy. \r\nLive and learn. \r\n\"What would someone who loves themselves do?\"\r\n\r\nThat's a good question right now. \r\nDo I go balls to the walls and just find a job? Any job for sustainability?\r\nIf I got a low wage job. I'm pretty sure it would work out poorly. I'd get bitter at myself for panicking.\r\nNo. \r\n\r\nDon't panic. \r\n\r\nLook for a job, but this is an opportunity to art that you WILL NOT get again. \r\nTreat it as such. \r\n\r\n\"Remember that winter I did a painting every week?\"\r\n\r\nThat would sound awesome. \r\nI have loftier dreams, and dreams come true with work. \r\n\r\nSO it's 707am and I'm starting drawing already.\r\n\r\nThis is going to be another day of twitch streaming and I'm not even sure exactly what I'm going to do. \r\nI'm SUPPOSED to be entertaining.",
    "image": ""
  },
  {
    "timestamp": "2025-01-02T11:32:32.506Z",
    "log": "That year wasn't so bad. \r\n\r\nEspecially the last couple of months. \r\nI lost my job, but for most of the year I made good money.\r\n\r\nI did break into painting a bit, I made my own Twitch account and started streaming my painting. \r\nI had support from my friend Sean Galaviz, he gave me some music to use that's awesome. \r\nI haven't honored him enough in that regard, and I need to make the music thing on Twitch. \r\n\r\nI should be extremely busy for the next 4 days before I start this job at Bonchon. \r\n\r\nHopefully I can get in good with that new company and make some money. \r\n\r\n\r\n\r\nFor this year I have a few goals\r\n\r\n1.Jogging 5 miles per week.\r\n2. Get my twitch stream to 40 followers.\r\n3. Get 7 paintings done. \r\n\r\n\r\nBy the end of the next few DAYS, it would be awesome to get to my website up.",
    "image": ""
  },
  {
    "timestamp": "2025-01-02T11:33:35.231Z",
    "log": "Japan",
    "image": "/uploads/eb8a8bc97a9d0e1324642a202c0bba0b"
  },
  {
    "timestamp": "2025-01-08T14:28:42.360Z",
    "log": "Yesterday was a bunch of BS.\r\n\r\nI started this new job. Nearly cried when I saw myself in the mirror, wearing a visor. \r\n\r\nIt's not bad people, but I'd much rather do something else. I have only myself to blame for that and I'm afraid I won't have time to build a website WITH a job.\r\n\r\nSo far that's proven to be true, but I'm not going to give up just yet. That was day 1. \r\n\r\nLet's go!!!",
    "image": ""
  },
  {
    "timestamp": "2025-01-13T17:11:22.080Z",
    "log": "I got my website to send emails to me in a contact form. It's responsive and I love it so far. My website that is. I want to make things so awesome with it. \r\nIt's been this rollercoaster of punishment when I mess up and I have to try again and again and I'll waste hours on a problem that's stupid. \r\n\r\nRight now, I could publish, and that's my next step. I'm so close to a step that I've wanted so badly in my life... and I don't want to celebrate, but I will get a short story when this is done. \r\n\r\nTo mock the occasion (heh) I wrote a contact form to myself from Satan:\r\n\r\n\"Hey there. I saw you were making progress, and I just want you to know it's all for naught. \r\nYup, you'll either be stopped before you publish tomorrow, due to some technical issue or it'll go so unnoticed it won't matter. \r\n\r\nJust making sure that you don't get your hopes up.\r\nYou will live the rest of your life in fast food hell, unable to muster the energy to break out of the slow erosion of your own spirit by a corporation. \"\r\n\r\n\r\n\r\n     I love my subconscious. \r\n\r\n\r\n  Anyway, this job is already a nightmare. My hands itch from dishwater and are deepfried from well, a 7 foot wall of deepfrier.\r\n\r\n  It's just wonderful. \r\n\r\n  Anyways, I can't wait to get my website up and then hopefully get a QR code pointing to it and then boom! Hopefully I can get a job. \r\n\r\nRice.",
    "image": ""
  },
  {
    "timestamp": "2025-02-06T06:35:06.273Z",
    "log": "Alright. Today begins a 6 month routine of 1 hr of drawing every day. Even on Vacation. \r\n\r\nI've done well so far, I have my other website up and going on ... I'll",
    "image": "/uploads/6016f616365b4a997c12594e09182c67"
  }
]